; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image3 - mode
	image4 - mode
	thermograph0 - mode
	image2 - mode
	thermograph5 - mode
	infrared1 - mode
	infrared6 - mode
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star0 - direction
	GroundStation1 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph5)
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star0)
	(supports instrument1 image2)
	(supports instrument1 image4)
	(supports instrument1 infrared6)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
)
(:goal (and
	(pointing satellite0 Planet8)
	(have_image Phenomenon7 image4)
	(have_image Planet8 image3)
	(have_image Planet8 image4)
	(have_image Star9 image3)
	(have_image Star10 infrared1)
	(have_image Planet11 thermograph0)
	(have_image Planet12 image3)
	(have_image Phenomenon13 image3)
	(have_image Phenomenon13 image4)
	(have_image Planet14 thermograph5)
	(have_image Planet14 image3)
))

)

; plan
1. (turn_to satellite0 star0 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star0)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 star9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star9)
   goals met: 0 of 12
5. (take_image satellite0 star9 instrument0 image3)
   added: (have_image star9 image3)
   goals met: 1 of 12
6. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 1 of 12
7. (take_image satellite0 star10 instrument0 infrared1)
   added: (have_image star10 infrared1)
   goals met: 2 of 12
8. (turn_to satellite0 planet8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet8)
   goals met: 3 of 12
9. (take_image satellite0 planet8 instrument0 image3)
   added: (have_image planet8 image3)
   goals met: 4 of 12
10. (turn_to satellite0 planet14 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet14)
   goals met: 3 of 12
11. (take_image satellite0 planet14 instrument0 thermograph5)
   added: (have_image planet14 thermograph5)
   goals met: 4 of 12
12. (take_image satellite0 planet14 instrument0 image3)
   added: (have_image planet14 image3)
   goals met: 5 of 12
13. (turn_to satellite0 planet12 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet12)
   goals met: 5 of 12
14. (take_image satellite0 planet12 instrument0 image3)
   added: (have_image planet12 image3)
   goals met: 6 of 12
15. (turn_to satellite0 phenomenon13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon13)
   goals met: 6 of 12
16. (take_image satellite0 phenomenon13 instrument0 image3)
   added: (have_image phenomenon13 image3)
   goals met: 7 of 12
17. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 7 of 12
18. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 7 of 12
19. (turn_to satellite0 groundstation1 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation1)
   goals met: 7 of 12
20. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 7 of 12
21. (turn_to satellite0 phenomenon13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon13)
   goals met: 7 of 12
22. (take_image satellite0 phenomenon13 instrument1 image4)
   added: (have_image phenomenon13 image4)
   goals met: 8 of 12
23. (turn_to satellite0 phenomenon7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon7)
   goals met: 8 of 12
24. (take_image satellite0 phenomenon7 instrument1 image4)
   added: (have_image phenomenon7 image4)
   goals met: 9 of 12
25. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 9 of 12
26. (take_image satellite0 planet11 instrument1 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 10 of 12
27. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 11 of 12
28. (take_image satellite0 planet8 instrument1 image4)
   added: (have_image planet8 image4)
   goals met: 12 of 12
